#имена переменных должны записываться маленькими буквами через знаки подчёркивания: my_variable
#Python - Case sensative language
#В Python нет отдельной синтаксической конструкции для объявления констант. Это указание для програмиста
#Принято константы записывть заглавными буквами MY_CONSTANT

#Типизация - операция назначения типо информационным сущностям
#Типизация бывает статическая, динамическая, сильная(строгая), слабая(не строгая).
#Статическая - типы данных определяются НА ЭТАПЕ КОМПИЛЧЦИИ. При статической типизации переменная НЕ МОЖЕТ изменить тип данных
#Динамическая - тип переменной определяется ВО ВРЕМЯ ПРИСВОЕНИЯ ЕЙ ЗНАЧЕНИЯ. При ДИНАМИЧЕСКОЙ типизации переменная МОЖЕТ изменить тип данных
#Система называется сильной -если она не допускает появляния ошибок несовместимости типов
#Система называется слобой - если можно выполнить операция над несовместимыми данными и получить непредстказуемый результат

#Python - динамический со строгой типизацией

#Целые 
# int - либо 4 байтные либо 8 байтные значения. Python сам смотрит что ему использовать
# bool - это целочисленный тип данных, наследуется от int (возможные значение 1-True, 0-False)

#Вещественные числа
# float - число с плавающей запятой ДВОЙНОЙ ТОЧНОСТИ

#Комплексные числа
#complex

#Контейнеры и последовательности
#Неизменяемые - str, tuple ....
#Изменяемые - list

#None
#Это еденичный тип данных - None. None используется, чтобы смотреть есть ли у переменной значение
